{"all":10, 
 "quotes":{
    "1":"After this whole acting thing is over and done, you eventually have to be human. Some people are never human. It's very weird.",
    "2":"Apartment living is tough action. Just the whole idea that you share a washer and dryer always freaked me out.",
    "3":"Because I have a girlfriend, I try and take the straight and narrow path, which is good because it prevents VD.",
    "4":"Being a celebrity or anything else where you're really ambitious, it's really a game to see how successful you can get.",
    "5":"Comedy is really not like any other art form in that it's very specialized and varied in it's content, but generic in it's title.",
    "6":"Dick Gregory was a great comedian who went and got arrested, did hunger strikes, protests. It never hurt his career to be outspoken.",
    "7":"Have you ever talked to someone, and you're not even really talking to them? Actors are the worst for that.",
    "8":"I don't care if you're gay, black, Chinese, straight. That means nothing to me. It's all an illusion.",
    "9":"I had a great time on News Radio, I got to make tons of money in relative obscurity and learn a lot about the TV biz and work on my standup act constantly. It was a dream gig.",
    "10":"I had seen movies before that that had made me laugh, but I had never seen anything even remotely close to as funny as Richard Pryor was, just standing there talking.",
    "11":"I really never had any ambitions to be a standup comic. I was talked into it by guys that I used to work out with.",
    "12":"I talk so much about sex that girls just want to meet me.",
    "13":"I wouldn't totally rule out doing Letterman or the Tonight Show if I had a set that I just happened to write that I thought was funny but was still appropriate for network censors. But I'm not going to go out of my way.",
    "14":"I'm a huge Groucho fan. There were some great comic minds that would transfer into any generation, and Groucho is certainly one of them.",
    "15":"If someone plays a brooding actor in a film, people think they're brooding all the time.",
    "16":"If you are the greatest, why would you go around talking about it?",
    "17":"If you can lie, you can act, and if you can lie to crazy girlfriends, you can act under pressure.",
    "18":"It never hurt Lenny Bruce's career to get arrested for swearing. It did back in the time, but he broke those doors down by doing the stuff that he believed in.",
    "19":"It's painful for me to watch someone who isn't funny. It's horrifying to sit in the back and watch some guy who just totally sucks.",
    "20":"My act is so completely and totally uncensored that the only way I could really pull it off is if I treat the audience like they're my best friends.",
    "21":"Never stay in a bad marriage, and don't hang around with psycho coke fiends.",
    "22":"People for the most part can smell lies.",
    "23":"People want their 15 minutes and are willing to do anything to get it.",
    "24":"Richard Pryor is, in my mind, the most honest comedian. He bared his soul to people. I think that's why everybody loved him so much.",
    "25":"That's my only goal. Surround myself with funny people, and make sure everyone has a good time and works hard.",
    "26":"The audience changes every night. You're the same person. You have to speak your mind and do the stuff that you think is funny and makes you laugh.",
    "27":"Once you understand what excellence is all about you see how excellence manifests itself in any discipline.",
    "28":"There's only one way to get good at anything; you surround yourself with the bad motherfuckers who are doing exactly you do and you force yourself to keep up and inspire each other.",
    "29":"Life is strange.  You keep moving and keep moving.  Before you know it, you look back and think,  What was that?'",
    "30":"If you ever start taking things too seriously, just remember that we are talking monkeys on an organic spaceship flying through the universe. ",
    "31":"Be cool to people. Be nice to as many people as you can. Smile to as many people as you can, and have them smile back at you.",
    "32":"To me, comedy is a great occupation because I don't really worry that much about what other people think of me.",
    "33":"The time you spend hating on someone robs you of your own time. You are literally hating on yourself and you don't even realize it.",
    "34":"The key to happiness doesn't lay in numbers in a bank account but in the way we make others feel and the way they make us feel.",
    "35":"I'm obsessed to extreme winners because I think there's a madness to it. I truly believe that in order to truly be great at something you have to give into a certain amount of madness.",
    "36":"There's a never-ending ocean of techniques out there.",
    "37":"The quicker we all realize that we've been taught how to live life by the people that were operating on the momentum of an ignorant past the quicker we can move to a global ethic of community that doesn't value invented borders or the monopolization of natural resources, but rather the goal of a happier more loving humanity.",
    "38":"People for the most part can smell lies.",
    "39":"Life is about the pursuit of excellence. That pursuit is probably more exciting to me now more than ever.",
    "40":"I had a sense of who I was before I got famous.",
    "41":"The misconception is that standup comics are always on. I don't know any really funny comics that are annoying and constantly trying to be funny all the time.",
    "42":"That's my only goal. Surround myself with funny people, and make sure everyone has a good time and works hard.",
    "43":"If you are the greatest, why would you go around talking about it?",
    "44":"Have you ever talked to someone, and you're not even really talking to them? Actors are the worst for that.",
    "45":"Greatness and madness are next door neighbors and they often borrow each other's sugar.",
    "46":"Reality really is a theatre. There's no other way to describe it. It's all so nonsensical, ridiculous and chaotic.",
    "47":"Being a celebrity or anything else where you're really ambitious, it's really a game to see how successful you can get.",
    "48":"Never stay in a bad marriage, and don't hang around with psycho coke fiends.",
    "49":"Haters are all failures. It's 100% across the board. No one who is truly brilliant at anything is a hater.",
    "50":"No matter how civilized we are and how much society has curbed violent behavior. Human beings still have the same genes they had 10,000 years ago. Our bodies are designed to have a certain amount of physical stress and violence in them. We're designed to run from jaguars and fight to defend our territory.",
    "51":"When someone comes along and expresses him or herself as freely as they think, people flock to it. They enjoy it.",
    "52":"It's been one of the most important tools for me in personal growth for understanding myself, how I am, and what effect I do have on other people.",
    "53":"Be the hero of your own story.",
    "54":"Not all comedy clubs or situations are ideal, especially when you're first coming up and I think that's good for you. Eventually, you get to express your real personality.",
    "55":"I've been inspired by a shitload of people in my life so if there's ever anybody that I can inspire, to me that's a huge gift. To be able to turn that back around.",
    "56":"What's interesting about science is that we're constantly discovering new things about the universe, about ourselves, about our bodies, about diseases, about the possibilities of the future. It's amazing. Science is one of the coolest things about being a human being without a doubt.",
    "57":"Someone else's success does not equal a failure for you.",
    "58":"Martial arts are a vehicle for developing your human potential.",
    "59":"The audience changes every night. You're the same person. You have to speak your mind and do the stuff that you think is funny and makes you laugh.",
    "60":"Kindness is one of the best gifts you can bestow. We know that inherently that feels great.",
    "61":"Excellence in anything increases your potential in everything.",
    "62":"I want to make sure that everything that I'm creating, I'm creating it so other people get enjoyment out of it. And that's the reward that you get for that.",
    "63":"The beautiful thing about podcasting is it's just talking. It can be funny, or it can be terrifying. It can be sweet. It can be obnoxious. It almost has no definitive form. In that sense it's one of the best ways to explore an idea, and certainly much less limiting than trying to express the same idea in stand up comedy. For some ideas stand up is best, but it's really, really nice to have podcasts as well.",
    "64":"You can't measure what's inside a man's heart.",
    "65":"I want to talk about the nature of human beings or how we're evolving as a race.",
    "66":"One of the things that happened is I did a lot of shitty gigs. When you do a bunch of shitty bar gigs you have to get used to people yelling at you, you're used to thinking on the fly, to dealing with weird situations.",
    "67":"Work for that feeling that you have accomplished something. Don't waste your time on this earth without making a mark.",
    "68":"I've done jiujitsu a huge chunk of my life, and I try to spend a lot of time educating people on the nuances, the subtleness of the ground game. It's a big part of mixed martial arts.",
    "69":"There's a confidence and a mental toughness that comes from the very highest level of competition, whatever the sport is. Whether it's boxing or wrestling, or whatever.",
    "70":"My act is so completely and totally uncensored that the only way I could really pull it off is if I treat the audience like they're my best friends.",
    "71":"If you can lie, you can act, and if you can lie to crazy girlfriends, you can act under pressure.",
    "72":"We're constantly re-evaluating the potential for life. We're finding it where we didn't think it could exist, such as volcanic vents and other extreme conditions like under arctic ice. We're finding life in these incredibly harsh and dynamic conditions, so we're having to re-evaluate our own ideas of what's possible on this planet alone.",
    "73":"The mind is the most important thing of the big picture and no one has a stronger mindset than amateur wrestlers.",
    "74":"Richard Pryor is, in my mind, the most honest comedian. He bared his soul to people. I think that's why everybody loved him so much.",
    "75":"By putting yourself in that intense form of stress, it makes regular life more peaceful.",
    "76":"Having the privilege of sitting down and having 3 hour long uninterrupted conversations with hundreds of brilliant people is an awesome perspective enhancer.",
    "77":"We are in like this wave of like of being evolved and not being evolved. Same time like technologically spectacularly evolved to the point where we can bend matter and create nuclear weapons and fly robots to Mars and take pictures and send it back to us, like the shit we can do is off the charts.", 
    "78":"Its definitely not crazy. Its Marihuana, its legal, its good for you.", 
    "79":"If you looked at all the zeros on that number, you wouldn't be able to wrap your head around it. Like whaat. Whats a billion? How many zeros is that? At least a million? How many trillions are in a billion?", 
    "80":"When chimps attack, they rip your dick off.", 
    "81":"Moose is fantastic. Moose and Elk are real similar. It got an amazing taste to it.", 
    "82":"How about a ball of meat that gives you butter.", 
    "83":"Conspiracy Theories? We gotta get Eddie Bravo in here.", 
    "84":"We are professional MMA fans.",
    "85":"Did I ever show you the picture of the tree that was growing in my toilet pipe?", 
    "86":"But have you tried dmt though?"
 }
}
