{
  "num":366,
  "riddles": 
 {
    "1":"I am strong enough to smash ships, but I fear the Sun. What am I?",
    "2":"Ice.",
    "3":"Lily is a lillypad in a small pond. Lilly doubles her size each day, On the 20th day she cover the whole pond. On what day was Lily half the size of the pond?",
    "4":"Day 19, it's not 10 because on day 20 she doubled from day 19, so 19 must be half the size of the pond.",
    "5":"I am served at a table, In gatherings of two or four; Served small, white and round. You'll love some, And that's part of the fun. What am I?",
    "6":"Ping Pong Balls.",
    "7":"How can we tell that Saturn was married more than once?",
    "8":"Because she has so many rings!",
    "9":"When you add meat to me, I become vegetarian. What am I?",
    "10":"Mince",
    "11":"I start with a p and ends with o-r-n and I'm a major player in the film industry. What am I?",
    "12":"Popcorn.",
    "13":"I am strong enough to smash ships, but I fear the Sun. What am I?",
    "14":"Ice.",
    "15":"What four-legged animal can jump higher than a house?",
    "16":"Any, Houses can't jump.",
    "17":"Why do skeletons go on vacations alone?",
    "18":"Because they have no-body to go with.",
    "19":"No matter how little or how much you use me, you change me every month. What am I?",
    "20":"A Calendar.",
    "21":"What do cheerleaders eat for breakfast?",
    "22":"Cheer-eee-ohs!",
    "23":"A man walks into a bar and immediately falls unconscious. Why?",
    "24":"It was an iron bar!",
    "25":"What language does a billboard speak?",
    "26":"Sign language.",
    "27":"What do you call a 100-year-old ant?",
    "28":"An antique!",
    "29":"What do you call a wizard from outer space that can fly?",
    "30":"A flying sorcerer!",
    "31":"What is one thing that all wise men, regardless of their politics or religion, agree is between heaven and earth?",
    "32":"The word 'And'.",
    "33":"Stranger: Does your dog bite? Farmer: Nope. All of the sudden the dog bites the stranger on the leg. Yet the farmer was telling the truth! How can this be?",
    "34":"It was not the farmers dog! hahahaha",
    "35":"What would you get if 120 rabbits took one step backwards at the same time?",
    "36":"A receding hair line.",
    "37":"One day, the police found a man dead inside a hut. In his left hand, he's holding a gun. In his right hand, he has a recording. When the recording is played, the police hear the man talking about how horrible life is and how he wants it to end. The recording ends with a gunshot. The police are about to call it a suicide until you point out a very important clue. What is it?",
    "38":"The recording played a gunshot inside it. If the man committed suicide, he wouldn't have been able to stop the recording after he pulled the trigger.",
    "39":"It has a long neck, A name of a bird, Feeds on cargo of ships, It's not alive. What is it?",
    "40":"A crane.",
    "41":"What is that which every one can divide, but no one can see where it has been divided?",
    "42":"Water.",
    "43":"A woman shoots her husband. Then she holds him under water for over 5 minutes. Finally, she hangs him. But 5 minutes later they both go out together and enjoy a wonderful dinner together. How can this be?",
    "44":"The woman was a photographer. She shot a picture of her husband, developed it, and hung it up to dry.",
    "45":"What is black when you buy it, red when you use it, and gray when you throw it away?",
    "46":"Charcoal.",
    "47":"I am taken from a mine, and shut up in a wooden case, from which I am never released, and yet I am used by almost everybody. What am I?",
    "48":"Pencil lead.",
    "49":"A boy was at a carnival and went to a booth where a man said to the boy, 'If I write your exact weight on this piece of paper then you have to give me $50, but if I cannot, I will pay you $50.' The boy looked around and saw no scale so he agrees, thinking no matter what the carny writes he'll just say he weighs more or less. In the end the boy ended up paying the man $50. How did the man win the bet?",
    "50":"The man did exactly as he said he would and wrote 'your exact weight' on the paper.",
    "51":"David's father has three sons : Snap, Crackle and _____ ?",
    "52":"David.",
    "53":"What is the worst vegetable to have on a ship?",
    "54":"A leek(leak).",
    "55":"There are two monkeys on a tree and one jumps off. Why does the other monkey jump too?",
    "56":"Monkey see monkey do.",
    "57":"When is music like vegetables?",
    "58":"When there are two beats (beets) to the measure.",
    "59":"What can you find in the center of gravity?",
    "60":"The letter 'V'",
    "61":"Which is the only way a leopard can change his spots?",
    "62":"By going from one spot to another.",
    "63":"What can be seen in the middle of March and April that cannot be seen at the beginning or end of either month?",
    "64":"The letter 'r'.",
    "65":"How far is it from March to June?",
    "66":"A single spring.",
    "67":"I have a little house in which I live all alone. It has no doors or windows, and if I want to go out I must break through the wall. What am I?",
    "68":"A chick in an egg.",
    "69":"I can't be bought, but I can be stolen with a glance. I'm worthless to one, but priceless to two. What am I?",
    "70":"Love.",
    "71":"Until I am measured I am not known, Yet how you miss me when I have flown. What Am I?",
    "72":"Time.",
    "73":"What word doesn't belong in this group? That, hat, what, mat, cat, sat, pat, or chat?",
    "74":"What. It's pronounced differently; all of the others rhyme.",
    "75":"Two words, my answer is only two words. To keep me, you must give me.",
    "76":"'Your word'.",
    "77":"George, Helen, and Steve are drinking coffee. Bert, Karen, and Dave are drinking soda. Using logic, is Elizabeth drinking coffee or soda?",
    "78":"Elizabeth is drinking coffee. The letter E appears twice in her name, as it does in the names of the others that are drinking coffee.",
    "79":"I reach for the sky, but clutch to the ground; sometimes I leave, but I am always around. What am I?",
    "80":"I am Tree.",
    "81":"You use a knife to slice my head and weep beside me when I am dead. What am I?",
    "82":"An onion.",
    "83":"Look in my face, I am somebody; Look in my back, I am nobody. What am I?",
    "84":"I am a mirror.",
    "85":"What 4-letter word can be written forward, backward or upside down, and can still be read from left to right?",
    "86":"NOON.",
    "87":"What did the bee say to the flower?",
    "88":"Hello, honey!",
    "89":"A time when they are green, a time when they're brown, but both of these times, cause me to frown. But just in between, for a very short while, They're perfect and yellow and cause me to smile! What am I talking about here?",
    "90":"Bananas.",
    "91":"What has many keys, but can't even open a single door?",
    "92":"A piano.",
    "93":"How do you spell COW in thirteen letters?",
    "94":"SEE O DOUBLE YOU.",
    "95":"Why should you never iron a 4-leaf clover?",
    "96":"You don't want to press your luck!",
    "97":"Why is the largest city in Ireland likely to be the largest city in the world?",
    "98":"Because it is every year doubling (Dublin).",
    "99":"Railroad Crossing, look out for the cars. Can you spell that, without any R's?",
    "100":"That.",
    "101":"Five apples are in a basket. How do you divide them among five girls so that each girl gets an apple, but one apple remains in the basket?",
    "102":"Give the fifth girl her apple in the basket.",
    "103":"I'm white, and used for cutting and grinding. When I'm damaged, humans usually remove me or fill me. For most animals I am a useful tool. What am I?",
    "104":"A tooth!",
    "105":"You have three stoves: a gas stove, a wood stove, and a coal stove, but only one match. Which should you light first?",
    "106":"The match!",
    "107":"I am white when I am dirty, and black when I am clean. What am I?",
    "108":"A blackboard.",
    "109":"What is harder to catch the faster you run?",
    "110":"Your breath!",
    "111":"Ben walked into a hardware store and asked the price of some items. The salesman said: One costs $1, Eight costs $1, Seventeen cost $2, One hundred four costs $3 and One thousand seventy two costs $4. What was Ben buying?",
    "112":"Ben was buying home address numbers and they cost $1 per digit.",
    "113":"I come in a cone but I am not food; I will be skewed if you screw with my hue; I come by the millions but you can probably only name a few. What am I?",
    "114":"Colors.",
    "115":"Can you name three consecutive days without using the words Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, or Sunday?",
    "116":"Yesterday, Today, and Tomorrow.",
    "117":"I'm tall when I'm young and I'm short when I'm old. What am I?",
    "118":"Candle or Pencil.",
    "119":"I am full of holes but I can still hold water. What am I?",
    "120":"A sponge!",
    "121":"The more you take, the more you leave behind. What am I?",
    "122":"Footsteps.",
    "123":"What has to be taken before you can get it?",
    "124":"Your picture.",
    "125":"What two things can you never eat for breakfast?",
    "126":"Lunch and dinner.",
    "127":"You can see nothing else When you look in my face, I will look you in the eye and I will never lie. What am I?",
    "128":"I am your reflection.",
    "129":"Some months have 30 days, some months have 31 days. How many have 28?",
    "130":"They all do.",
    "131":"Never resting, never still. Moving silently from hill to hill. It does not walk, run or trot, All is cool where it is not. What is it?",
    "132":"Sunshine.",
    "133":"You have me today, Tomorrow you'll have more; As your time passes, I'm not easy to store; I don't take up space, But I'm only in one place; I am what you saw, But not what you see. What am I?",
    "134":"Memories.",
    "135":"Sometimes I am born in silence, Other times, no. I am unseen, But I make my presence known. In time, I fade without a trace. I harm no one, but I am unpopular with all. What am I?",
    "136":"A fart.",
    "137":"I can be cracked, I can be made. I can be told, I can be played. What am I?",
    "138":"A Joke!",
    "139":"A man was found murdered on Sunday morning. His wife immediately called the police. The police questioned the wife and staff and got these alibis: The Wife said she was sleeping. The Cook was cooking breakfast. The Gardener was picking vegetables. The Maid was getting the mail. The Butler was cleaning the closet. The police instantly arrested the murderer. Who did it and how did they know?",
    "140":"It was the Maid. She said she was getting the mail. There is no mail on Sunday!",
    "141":"What falls down but never breaks?",
    "142":"Nightfall.",
    "143":"I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breathe on this terrestrial ball. What am I?",
    "144":"Tomorrow.",
    "145":"What question can someone ask all day long, always get completely different answers, and yet all the answers could be correct?",
    "146":"'What time is it?'",
    "147":"What 8 letter word can have a letter taken away and it still makes a word. Take another letter away and it still makes a word. Keep on doing that until you have one letter left. What is the word?",
    "148":"The word is starting! starting, staring, string, sting, sing, sin, in, I. Cool,huh?",
    "149":"What kind of bars won't keep a prisoner in jail?",
    "150":"Chocolate bars.",
    "151":"What has wheels and flies, but it is not an aircraft?",
    "152":"A garbage truck.",
    "153":"What asks no questions but requires many answers?",
    "154":"A doorbell.",
    "155":"I have no feet, no hands, no wings, but I climb to the sky. What am I?",
    "156":"Smoke.",
    "157":"What can you catch but never throw?",
    "158":"A cold.",
    "159":"A doctor and a bus driver are both in love with the same woman, an attractive girl named Sarah. The bus driver had to go on a long bus trip that would last a week. Before he left, he gave Sarah seven apples. Why?",
    "160":"An apple a day keeps the doctor away!",
    "161":"What can be touched but can't be seen?",
    "162":"Someone's heart",
    "163":"What kind of nut has no shell?",
    "164":"A Doughnut.",
    "165":"What can hold water even though it has holes?",
    "166":"A Sponge.",
    "167":"You can touch me, You can break me, You should win me if you want to be mine. What am I?",
    "168":"A heart.",
    "169":"What English word retains the same pronunciation, even after you take away four of its five letters?",
    "170":"Queue.",
    "171":"A horse was tied to a rope 5 meters long and the horses food was 15 meters away from the horse. How did the horse reach the food?",
    "172":"The rope wasn't tied to anything so he could reach the food.",
    "173":"What is it that given one, you'll have either two or none?",
    "174":"A choice.",
    "175":"I have a heart that never beats, I have a home but I never sleep. I can take a mans house and build anothers, And I love to play games with my many brothers. I am a king among fools. Who am I?",
    "176":"The King of Hearts in a deck of cards.",
    "177":"This is as light as a feather, yet no man can hold it for long. What am I?",
    "178":"Your Breath.",
    "179":"Why is Europe like a frying pan?",
    "180":"Because it has Greece at the bottom.",
    "181":"Samuel was out for a walk when it started to rain. He did not have an umbrella and he wasn't wearing a hat. His clothes were soaked, yet not a single hair on his head got wet. How could this happen?",
    "182":"This man is bald!",
    "183":"A man rode out of town on Sunday, he stayed a whole night at a hotel and rode back to town the next day on Sunday. How is this possible?",
    "184":"His Horse was called Sunday!",
    "185":"My life can be measured in hours, I serve by being devoured. Thin, I am quick. Fat, I am slow. Wind is my foe. What am I?",
    "186":"I am a candle.",
    "187":"I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I?",
    "188":"Fire.",
    "189":"What belongs to you, but other people use it more than you?",
    "190":"Your name.",
    "191":"What animal is most likely to eat a relative?",
    "192":"An ant-eater!",
    "193":"The more there is the less you see. What is it?",
    "194":"Fog.",
    "195":"I'm found in socks, scarves and mittens. I'm found in the paws of playful kittens. What am I?",
    "196":"Yarn.",
    "197":"I am six letters. When you take one away I am twelve. What am I?",
    "198":"The word Dozens.",
    "199":"A magician was boasting one day at how long he could hold his breath under water. His record was 6 minutes. A kid that was listening said, 'that's nothing, I can stay under water for 10 minutes using no types of equipment or air pockets!' The magician told the kid if he could do that, he'd give him $10,000. The kid did it and won the money. Can you figure out how?",
    "200":"The kid filled a glass of water and held it over his head for 10 minutes.",
    "201":"I run in and out of town all day and night. What am I?",
    "202":"A road.",
    "203":"What has six faces, but does not wear makeup, has twenty-one eyes, but cannot see? What is it?",
    "204":"A die (dice).",
    "205":"What has no body and no nose?",
    "206":"Nobody knows.",
    "207":"What can you hold in your right hand, but not in your left?",
    "208":"Your left hand!",
    "209":"Even if they are starving, natives living in the Arctic will never eat a penguin's egg. Why not?",
    "210":"Penguins only live in Antartica.",
    "211":"What TV programs do cows watch in bed?",
    "212":"Moo-vies.",
    "213":"Why did Tigger go to the bathroom?",
    "214":"He wanted to find his friend, Pooh!",
    "215":"One lady ordered a fast delivery pizza and her order came the next year. How is this possible?",
    "216":"She ordered the pizza for New Years Day.",
    "217":"Why does a dragon sleep all day?",
    "218":"So it can hunt knights!",
    "219":"You're sitting down for breakfast and realize you have 4 bagels left. You know you'll run out in four days so you cut them in half. How many bagels do you have now?",
    "220":"4 Bagels.",
    "221":"A pet shop owner had a parrot with a sign on its cage that said 'Parrot repeats everything it hears'. Davey bought the parrot and for two weeks he spoke to it and it didn't say a word. He returned the parrot but the shopkeeper said he never lied about the parrot. How can this be?",
    "222":"The parrot was deaf.",
    "223":"What happened when the rubber duckie fell into the bathtub?",
    "224":"It quacked up.",
    "225":"What starts with a T, ends with a T and has T in it?",
    "226":"A teapot.",
    "227":"I always follow you around, everywhere you go at night. I look very bright to people, but I can make the sun dark. I can be in many different forms and shapes. What am I?",
    "228":"The moon!",
    "229":"One is to three as three is to five and five is to four and four is the magic number. What is the pattern?",
    "230":"One has three letters in the word three has five letters in it five has four letters and four has four letters in it (if you try more numbers they will always come back to the number four: so four is the magic number)",
    "231":"They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?",
    "232":"Gloves.",
    "233":"There is a clothing store in Bartlesville. The owner has devised his own method of pricing items. A vest costs $20, socks cost $25, a tie costs $15 and a blouse costs $30. Using the method, how much would a pair of underwear cost?",
    "234":"$45. The pricing method consists of charging $5 for each letter required to spell the item.",
    "235":"When may a man's coat pocket be empty, and yet have something in it?",
    "236":"When it has a hole in it.",
    "237":"Flat as a leaf, round as a ring; Has two eyes, can't see a thing. What is it?",
    "238":"A button.",
    "239":"Tom and his younger sister were fighting. Their mother was tired of the fighting and decided to punish them by making them stand on the same piece of newspaper in such a way that they couldn't touch each other. How did she accomplish this?",
    "240":"Tom's mother slid a newspaper under a door, each sibling standing on each side.",
    "241":"I act like a cat, I look like a cat, Yet I am not a cat. What am I?",
    "242":"Kitten.",
    "243":"How can you take 2 from 5 and leave 4?",
    "244":"F I V E. Remove the 2 letters F and E from five and you have IV.",
    "245":"A slender body, a tiny eye, no matter what happens, I never cry. What am I?",
    "246":"A needle.",
    "247":"In what year did Christmas Day and New Year's Day fall in the same year?",
    "248":"It happens every year.",
    "249":"If eleven plus two equals one, what does nine plus five equal?",
    "250":"11 o'clock plus 2 hours = 1 o'clock 9 o'clock plus 5 hours = 2 o'clock",
    "251":"I run all around the pasture but never move. What am I?",
    "252":"A fence.",
    "253":"Tool of thief, toy of queen. Always used to be unseen. Sign of joy, sign of sorrow. Giving all likeness borrowed. What am I?",
    "254":"A mask.",
    "255":"What is more useful when it is broken?",
    "256":"An egg.",
    "257":"When does Christmas come before Thanksgiving?",
    "258":"In the dictionary.",
    "259":"What did Mrs. Claus say to Santa when she looked up in the sky?",
    "260":"Looks like rain dear.",
    "261":"What does a snowman like to eat for breakfast?",
    "262":"Frosted Flakes.",
    "263":"Why is Santa so good at Karate?",
    "264":"Because he has a black belt.",
    "265":"Who is never hungry during Christmas?",
    "266":"The turkey because he is always stuffed.",
    "267":"Which one of Santa's reindeer can be seen on Valentines day?",
    "268":"Cupid.",
    "269":"Why do mummies like Christmas so much?",
    "270":"Because of all the wrapping.",
    "271":"Which on of Santa's reindeer can you see in outer space?",
    "272":"Comet.",
    "273":"What do elves learn in school?",
    "274":"The elf-abet.",
    "275":"What did Adam say the day before Christmas?",
    "276":"It's Christmas, Eve!",
    "277":"What has four eyes and runs south?",
    "278":"The Mississippi River.",
    "279":"How can you physically stand behind your friend as he physically stands behind you?",
    "280":"By standing back to back.",
    "281":"Join a noun and adjective, and make a verb. What is the word?",
    "282":"Impeach.",
    "283":"You live in a one storey house made entirely of redwood. What color would the stairs be?",
    "284":"What stairs? You live in a one storey house.",
    "285":"What comes once in a minute, twice in a moment, but never in a thousand years?",
    "286":"The letter 'm'.",
    "287":"If there is a Yellow house on Bluebird Lane, a Green house on Orange Street, a Pink house on Kitten Road, a Black house on Whitehorse Pike and a Purple house on Firebird hill, where is the White house?",
    "288":"Washington, D.C.",
    "289":"A man went on a trip with a fox, a goose and a sack of corn. He came upon a stream which he had to cross and found a tiny boat to use to cross the stream. He could only take himself and one other - the fox, the goose, or the corn - at a time. He could not leave the fox alone with the goose or the goose alone with the corn. How does he get all safely over the stream?",
    "290":"Take the goose over first and come back. Then take the fox over and bring the goose back. Now take the corn over and come back alone to get the goose. Take the goose over and the job is done!",
    "291":"I am never quite what I appear to be. Straight-forward I seem, but it's only skin deep, for mystery most often lies beneath my simple speech. Sharpen your wits, open your eyes, look beyond my exteriors, read me backwards, forwards, upside down. Think critically and answer the question. What am I?",
    "292":"I am a Riddle!",
    "293":"I can be hairy and itchy all over. I hang on a stick. I can be the scariest thing you have ever seen. I stand in the middle of nowhere. What am I?",
    "294":"A scarecrow!",
    "295":"What do mathematics teachers like to eat?",
    "296":"Pi.",
    "297":"What is the end of everything?",
    "298":"The letter 'g'.",
    "299":"What question can never be answered with a Yes?",
    "300":"Are you asleep?",
    "301":"It has five wheels, though often think four, You cannot use it without that one more, You can put things in it, you can strap things on top, You can't find it in the market, but you can still go shop. What is it?",
    "302":"A car.",
    "303":"How can you tell the difference between dogs and trees?",
    "304":"By their bark.",
    "305":"Why did the cookie go to the doctors?",
    "306":"It felt crummy.",
    "307":"I'm as small as an ant, as big as a whale. I'll approach like a breeze, but can come like a gale. By some I get hit, but all have shown fear. I'll dance to the music, though I can't hear. Of names I have many, of names I have one. I'm as slow as a snail, but from me you can't run. What am I?",
    "308":"I am a shadow.",
    "309":"Who is that with a neck and no head, two arms and no hands? What is it?",
    "310":"A shirt.",
    "311":"Why did they let the Turkey join the thanksgiving band?",
    "312":"Because he had the drumsticks.",
    "313":"Why did the turkey cross the road?",
    "314":"To prove he wasn't chicken.",
    "315":"What smells the best at thanksgiving dinner?",
    "316":"Your nose.",
    "317":"If April showers bring may flowers, what do may flowers bring?",
    "318":"Pilgrims.",
    "319":"What kind of key do you use on Thanksgiving?",
    "320":"A Turkey.",
    "321":"Why didn't the turkey finish it's dessert?",
    "322":"Because it was stuffed.",
    "323":"Which side of the turkey has the most feathers?",
    "324":"The outside.",
    "325":"Where did pilgrims land when they arrived in America?",
    "326":"On their feet.",
    "327":"There is a common English word that is nine letters long. Each time you remove a letter from it, it still remains an English word - from nine letters right down to a single letter. What is the original word, and what are the words that it becomes after removing one letter at a time?",
    "328":"The base word is Startling - starting - staring - string - sting - sing - sin - in - I",
    "329":"I have a thousand needles but I do not sew. What am I?",
    "330":"A Porcupine.",
    "331":"How do you spell hard water with three letters?",
    "332":"Ice.",
    "333":"What falls often but never gets hurt?",
    "334":"Snow.",
    "335":"I dig out tiny caves, and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?",
    "336":"I am a Dentist.",
    "337":"If you drop me, I'm sure to crack. Give me a smile, and I'll always smile back. What am I?",
    "338":"A mirror.",
    "339":"I fly when I am born, lie when I'm alive, and run when I am dead. What am I?",
    "340":"A snowflake.",
    "341":"I'm like a doll, But I'm not for playing; I stand up straight, but if windy I may be laying; I'm well-known and famous for having no brain; I work outside both day and night in sunshine or in rain. What am I?",
    "342":"A Scarecrow.",
    "343":"What do you get when you cross a black cat and a lemon?",
    "344":"A Sour Puss.",
    "345":"The cost of making only the maker knows, Valueless if bought, but sometimes traded. A poor man may give one as easily as a king. When one is broken pain and deceit are assured. What am I?",
    "346":"A Promise.",
    "347":"You answer me, although I never ask you questions. What am I?",
    "348":"A telephone.",
    "349":"I do not breathe, but I run and jump. I do not eat, but I swim and stretch. I do not drink, but I sleep and stand. I do not think, but I grow and play. I do not see, but you see me every day. What am I?",
    "350":"I am a leg.",
    "351":"Only one color, but not one size,  Stuck at the bottom, yet easily flies.  Present in sun, but not in rain,  Doing no harm, and feeling no pain.  What is it?",
    "352":"It's a Shadow!",
    "353":"Within, I clean all that is bad and is old. I make juice that's the color of gold. Should I die, a filter machine would you need assembled To replace me, and beans I resemble. What am I?",
    "354":"A kidney.",
    "355":"What did the thief get for stealing the calendar?",
    "356":"12 Months.",
    "357":"I can be thin, But not fat; You need me around, I promise not to Crowd you; Some use a lot of me, Especially if they like to chat. What am I?",
    "358":"Air.",
    "359":"It doesn't bark, it doesn't bite but it still won't let you in the house. What is it?",
    "360":"A lock.",
    "361":"Why don't zombies eat popcorn with their fingers?",
    "362":"Because they prefer to eat their fingers separately.",
    "363":"Where do wolves stay on vacation?",
    "364":"At a howliday inn.",
    "365":"What room do ghosts avoid?",
    "366":"The living room.",
    "367":"How do you spell candy in 2 letters?",
    "368":"c and y c(and)y.",
    "369":"When is it bad luck to see a black cat?",
    "370":"When you are a mouse.",
    "371":"Which part of a road do Ghost's love to travel the most?",
    "372":"The Dead End.",
    "373":"Why did Snap, Crackle and Pop get scared?",
    "374":"They heard there was a cereal killer on the loose.",
    "375":"Why didn't the Mummy have any friends?",
    "376":"He was too wrapped up in himself.",
    "377":"What is a ghost's favorite dessert?",
    "378":"Ice Scream.",
    "379":"Where does a werewolf like to hide?",
    "380":"In your claws-it.",
    "381":"Why didn't the monster eat the crazy person?",
    "382":"He was allergic to nuts.",
    "383":"How do you fix a jack-o-lantern?",
    "384":"With a pumpkin patch.",
    "385":"What are ghost's favorite pants to wear?",
    "386":"Boo-jeans.",
    "387":"How do you know that a vampire loves baseball?",
    "388":"Because he turns into a bat every night.",
    "389":"What type of music is a mummy's favorite?",
    "390":"Wrap.",
    "391":"What kind of make up is a ghost's favorite to wear?",
    "392":"Mas-scare-a.",
    "393":"What jack has a head but no body?",
    "394":"Jack-o-lantern.",
    "395":"What did the spider say to the fly on Halloween?",
    "396":"The web is the trick and you are the treat.",
    "397":"Why did the vampire take art class?",
    "398":"He wanted to learn how to draw blood.",
    "399":"Who was the the most famous Skeleton detective?",
    "400":"Sherlock Bones.",
    "401":"What do you get if you cross a snowman with a witch?",
    "402":"A cold spell.",
    "403":"Where do baby ghosts go while their parents work?",
    "404":"To day scare!",
    "405":"Why didn't the skeleton use a towel?",
    "406":"Because he always comes out bone dry.",
    "407":"What do you call a witch that lives on the beach?",
    "408":"Sandwitch.",
    "409":"What is a ghost's favorite fruit?",
    "410":"BOO-BERRIES!",
    "411":"What instrument does a skeleton play?",
    "412":"Trombone.",
    "413":"You're in a room and there is a ghost in the room, but you're the only one in the room. How is this possible?",
    "414":"You're the ghost.",
    "415":"What do you call an out of work Ghost?",
    "416":"Lazy Bones.",
    "417":"What do ghost's like to do on a Saturday night?",
    "418":"BOOGIE.",
    "419":"Why do witches buy magazines?",
    "420":"They like to read the horrorscopes.",
    "421":"Why did the game warden arrest the Ghost?",
    "422":"He did not have a current haunting license.",
    "423":"What do you call two witches who live together?",
    "424":"Broommates!",
    "425":"Duels of good and evil,  A fighter of good am I,  Revealed beside watched words,  King of the black night sky.   What am I ?",
    "426":"The Dark.",
    "427":"You can see it everyday, But cannot touch it at will. What is it?",
    "428":"The sky.",
    "429":"I move without wings, between silken strings, I leave as you find, my substance behind. What am I?",
    "430":"A Spider.",
    "431":"It is a 5 letter word if you take away first letter it is something you get from sun, if you remove second letter you will get something to eat, if you remove third letter you get a word you use in pointing at and if you remove the fourth letter you get something to drink. What is it?",
    "432":"Wheat.",
    "433":"What day would yesterday be if Thursday was four days before the day after tommorow?",
    "434":"Friday.",
    "435":"No matter how smart you are, there is one thing you will always overlook. What is it?",
    "436":"Your own nose.",
    "437":"I am big on Saturday and Sunday. Small on Tuesday, Wednesday, and Thursday. I'm not on Monday or Friday. What am I?",
    "438":"The letter S.",
    "439":"Something that requires our mental skill to decode it, our imagination to understand it, our knowledge is tested to its max, it confuses us at every stage, it seems easy yet difficult, only those who are used to, will get through. What is it?",
    "440":"A riddle.",
    "441":"I am seen in the water if seen in the sky, I am in the rainbow, a jay's feather and lapis lazuli. What am I?",
    "442":"The color blue.",
    "443":"Squeeze me and I cry tears as red as flesh, but my heart is made of stone. What am I?",
    "444":"A cherry.",
    "445":"When its alive we sing, when it is dead we clap our hands. What is it?",
    "446":"A birthday candle.",
    "447":"Tommorrow Is Neither Wednesday Nor Thursday. Yesterday Was Not Friday Or Saturday. Today Is Not Thursday Nor Monday Nor Sunday. What Day Is Today?",
    "448":"Friday",
    "449":"A father's child, a mother's child, yet no one's son. Who am I?",
    "450":"The daughter.",
    "451":"The things I bite, they don't bleed, I don't bite until you push me; I bring my victims together each time I bite, But they'll come undone if you pull it just right. What am I?",
    "452":"A Stapler.",
    "453":"You're both in and outside of me; You guide me but don't ride me; I can make a statement with a tongue but no mouth. What am I?",
    "454":"Shoes.",
    "455":"You go in me for brushing, For flushing, For rushing; But please go in me one at a time, Or someone might be blushing. What am I?",
    "456":"A bathroom.",
    "457":"If you break me I do not stop working, If you touch me I may be snared, If you lose me nothing will matter. What am I?",
    "458":"Your heart.",
    "459":"Late afternoons I often bathe. I'll soak in water piping hot. My essence goes through my see through clothes. Used up am I; I've gone to pot. What am I?",
    "460":"I'm a tea bag!",
    "461":"I'm so fast you can't see me, though everyone else can see straight through me. I don't stop until the day you die. What am I?",
    "462":"The blink of an eye.",
    "463":"Which word is the odd one out: First, Second, Third, Forth, Fifth, Sixth, Seventh, and Eighth?",
    "464":"Forth, is incorrectly spelled. It should be Fourth.",
    "465":"I turn around once. What is out will not get in. I turn around again. What is in will not get out. What am I?",
    "466":"A Key.",
    "467":"Re-arrange the letters, O O U S W T D N E J R, to spell just one word. What is it?",
    "468":"'Just one word'.",
    "469":"A sphere has three, a circle has two, and a point has zero. What is it?",
    "470":"Dimensions.",
    "471":"Which of the following words don't belong in the group and why? CORSET, COSTER, SECTOR, ESCORT, COURTS",
    "472":"Courts. All of the others are anagrams of each other.",
    "473":"What falls but never breaks? What breaks but never falls?",
    "474":"Night and Day!",
    "475":"We capture light, and yet we don't. We reflect rays of sun, and yet we don't. Without us all the world is gray and dull for everyone. What are we?",
    "476":"Colors.",
    "477":"What is the longest word in the dictionary?",
    "478":"Smiles (there is a mile between the two S's)",
    "479":"I can slash but I have no knife, I can dash but I have no legs, I can pound but I have no hammer, I can star but I have no stage. What am I?",
    "480":"A Keyboard.",
    "481":"Name the only sport in which the ball is always in possession of the team on defense, and the offensive team can score without touching the ball?",
    "482":"Baseball!",
    "483":"I have no voice and yet I speak to you, I tell of all things in the world that people do. I have leaves, but I am not a tree, I have pages, but I am not a bride or royalty. I have a spine and hinges, but I am not a man or a door, I have told you all, I cannot tell you more. What am I?",
    "484":"A Book.",
    "485":"What word of five letters has only one left when two letters are removed?",
    "486":"Stone Remove 'St' and you're left with 'One'",
    "487":"A rich person doesn't need it A poor person has it And if you eat it you will die. What is it?",
    "488":"Nothing.",
    "489":"What English word has three consecutive double letters?",
    "490":"Bookkeeper.",
    "491":"It runs and runs but can never flee. It is often watched, yet never sees. When long it brings boredom, When short it brings fear. What is it?",
    "492":"Time, which is often watched when you stare at a clock.",
    "493":"What word is right when pronounced wrong, but is wrong when pronounced right?",
    "494":"The answer is wrong think about it.",
    "495":"As destructive as life, As healing as death; An institutioner of strife, Just as prone to bless. It is all that is good, Yet with an evil trend; As it was the beginning of things, It can also be the end. What is it?",
    "496":"It is fire!",
    "497":"My head and tail both equal are, My middle slender as a bee. Whether I stand on head or heel Is quite the same to you or me. But if my head should be cut off, The matter's true, though passing strange Directly I to nothing change. What Am I?",
    "498":"The figure eight.",
    "499":"What goes in the water red, and comes out black?",
    "500":"Iron.",
    "501":"What is made of wood but no saw on earth is sharp enough to cut?",
    "502":"Sawdust.",
    "503":"Why can't the world ever come to an end?",
    "504":"Because it's round.",
    "505":"Die without me, Never thank me. Walk right through me, Never feel me. Always watching, Never speaking. Always lurking, Never seen. What am I?",
    "506":"Air.",
    "507":"How much will a 38 angle measure when looked at under a microscope that magnifies ten times?",
    "508":"It will still be 38.",
    "509":"A skin have I, more eyes than one. I can be very nice when I am done. What am I?",
    "510":"A potato.",
    "511":"Forward I am heavy, but backward I am not. What am I?",
    "512":"The word Ton.",
    "513":"I like to roam but I'll always stay home, I leave a silver track, If you carried what I could carry with the way I moved, You'd break your neck and back. What am I?",
    "514":"A Snail.",
    "515":"What 7 letter word becomes longer when the third letter is removed?",
    "516":"Lounger.",
    "517":"I have four wings, but cannot fly, I never laugh and never cry; On the same spot I'm always found, toiling away with little sound. What am I?",
    "518":"A Windmill.",
    "519":"Forward and forward I go, never looking back. My limit no one knows, more of me do they lack. Like a river I do flow, and an eagle I fly. Now can you guess, what am I?",
    "520":"Time. I am time!",
    "521":"What goes in hard, comes out soft, and you blow continuously?",
    "522":"Bubble Gum.",
    "523":"Open me, and you can't see me without a mirror. Close me and you can't see me at all. What am I?",
    "524":"Your eyes.",
    "525":"What can fill a room but takes up no space?",
    "526":"Light.",
    "527":"A very pretty thing am I, fluttering in the pale-blue sky. Delicate, fragile on the wing, indeed I am a pretty thing. What am I?",
    "528":"I am a Butterfly.",
    "529":"Why is a bad pin like a broken lead pencil?",
    "530":"Because it has no point.",
    "531":"What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?",
    "532":"A river.",
    "533":"You can't see me, but I can see you; To be more specific, I see through. What am I?",
    "534":"An X-Ray.",
    "535":"Where do astronauts leave their spaceships?",
    "536":"At parking meteors",
    "537":"What do you get if you cross a hen with a guitar?",
    "538":"A chicken that plucks itself.",
    "539":"What is bright but sometimes doesn't give off light?",
    "540":"The moon.",
    "541":"Without a bridle, or a saddle, across a thing I ride a-straddle. And those I ride, by help of me, though almost blind, are made to see. What am I?",
    "542":"Eye glasses.",
    "543":"I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. What am I?",
    "544":"The letter e. End, timE, spacE, Every placE",
    "545":"What has a head, a tail, is brown, and has no legs?",
    "546":"A Penny.",
    "547":"A man was just doing his job when his suit was torn. Why did he die three minutes later?",
    "548":"He was an astronaut on a space walk, doing repairs.",
    "549":"What is shaped like a box, has no feet, and runs up and down?",
    "550":"An Elevator.",
    "551":"When do astronauts eat their sandwiches?",
    "552":"At launch time.",
    "553":"Whats 3/7 chicken, 2/3 cat, and 2/4 goat?",
    "554":"Chicago. The first three words out of seven of chicken is CHI, the first two words out of 3 of cat is CA, and first two words out of goat is GO. Therefore making, (CHI)(CA)(GO).",
    "555":"Why was the chicken forbidden from sending e-mails?",
    "556":"Because he kept using fowl language.",
    "557":"I drive men mad  For love of me,  Easily beaten,  Never free. What Am I?",
    "558":"Gold.",
    "559":"I am the beginning of sorrow, and the end of sickness. You cannot express happiness without me, yet I am in the midst of crosses. I am always in risk, yet never in danger. You may find me in the sun, but I am never out of darkness. What am I?",
    "560":"The letter S.",
    "561":"All of Mrs. Smith pets are dogs except one, and all her pets are cats except one. How many cats and dogs does she have?",
    "562":"Mrs. Smith has one cat and one dog.",
    "563":"What bird is always out of breath?",
    "564":"A puffin.",
    "565":"Why did outlaws sleep on the ground after robbing a bank?",
    "566":"They wanted to lie low.",
    "567":"Why did the tire need a vacation?",
    "568":"It couldn't take the pressure anymore?",
    "569":"What does a shark eat with peanut butter?",
    "570":"Jellyfish!",
    "571":"How does the moon cut his hair?",
    "572":"E-clipse it!",
    "573":"You give someone a dollar. You are this person's brother, but the person is not your brother. How can that be?",
    "574":"It's your sister!",
    "575":"What lies at the bottom of the sea and shivers?",
    "576":"A nervous wreck.",
    "577":"Why aren't elephants allowed on the beach?",
    "578":"They can't keep their trunks up!",
    "579":"What part of London is in France?",
    "580":"The letter N.",
    "581":"What do you call a bear with no teeth?",
    "582":"A gummy Bear.",
    "583":"Where do TVs go on vacation?",
    "584":"To remote places.",
    "585":"Why did the scarecrow win so many awards?",
    "586":"He was out-standing in his field!",
    "587":"Imagine you are in a dark room. How do you get out?",
    "588":"Stop Imagining! haha got you",
    "589":"A little pool with two layers of wall around it. One white and soft and the other dark and hard, amidst a light brown grassy lawn with an outline of a green grass. What am I?",
    "590":"A Coconut.",
    "591":"A big person and a small person are going to fish. The big person is not the small person father but the small person is the big person's son. What is the relationship between the two?",
    "592":"The big person is the small person's mother.",
    "593":"Carlos was out walking one day. He met his father-in-law's only daughter's mother-in-law. What did Carlos call her?",
    "594":"He called her Mom!",
    "595":"I am the ruler of shovels, I have a double. I am as thin as a knife, I have a wife. What am I?",
    "596":"The King of Spades (from a deck of cards).",
    "597":"What object has keys that open no locks, space but no room, and you can enter but not go in?",
    "598":"A computer keyboard.",
    "599":"From the beginning of eternity To the end of time and space To the beginning of every end And the end of every place. What am I?",
    "600":"The letter 'e'.",
    "601":"Where was the Declaration of Independence signed?",
    "602":"At the bottom.",
    "603":"What did the parrot say on the 4th of July?",
    "604":"Poly wants a firecracker!",
    "605":"I look flat, but I am deep, Hidden realms I shelter. Lives I take, but food I offer. At times I am beautiful. I can be calm, angry and turbulent. I have no heart, but offer pleasure as well as death. No man can own me, yet I encompass what all men must have. What am I?",
    "606":"An ocean.",
    "607":"What do you call a sleeping bull?",
    "608":"A bulldozer!",
    "609":"How many birth days does the average man have?",
    "610":"One!",
    "611":"If there are fifteen crows on a fence and the farmer shoots a third of them, how many crows are left?",
    "612":"None. The rest of the crows flew away when they heard the gunshot.",
    "613":"What has a foot on each side and one in the middle?",
    "614":"A yardstick.",
    "615":"How many of each type of animal did Moses take on the Ark?",
    "616":"None, it was Noah.",
    "617":"How many times can you subtract the number 5 from 25?",
    "618":"Only one time. After that, you would be subtracting from 20.",
    "619":"A farmer in California owns a beautiful pear tree. He supplies the fruit to a nearby grocery store. The store owner has called the farmer to see how much fruit is available for him to purchase. The farmer knows that the main trunk has 24 branches. Each branch has exactly 12 boughs and each bough has exactly 6 twigs. Since each twig bears one piece of fruit, how many plums will the farmer be able to deliver?",
    "620":"None. A pear tree does not bear plums.",
    "621":"While on my way to St. Ives, I saw a man with 7 wives. Each wife had 7 sacks. Each sack had 7 cats. Each cat had 7 kittens. Kitten, cats, sacks, wives, How many were going to St. Ives?",
    "622":"Just one, me.",
    "623":"How many letters are in the alphabet?",
    "624":"There are 11 letters in 'THE ALPHABET'. Did you say 26?",
    "625":"If you have three oranges and you take away two, how many will you have?",
    "626":"Two. The two you took.",
    "627":"If you're 8 feet away from a door and with each move you advance half the distance to the door. How many moves will it take to reach the door?",
    "628":"Infinity! Technically you will never reach the door, as you can only move half the distance, no matter how small.",
    "629":"If you put roast in a roaster, what do you put in toaster?",
    "630":"Bread.",
    "631":"They fill me up and you empty me, almost everyday; if you raise my arm, I work the opposite way. What am I?",
    "632":"A mailbox.",
    "633":"It can't be seen, can't be felt, can't be heard and can't be smelt. It lies behind stars and under hills, and empty holes it fills. It comes first and follows after, ends life and kills laughter. What is it?",
    "634":"The Dark.",
    "635":"I don't have eyes, but once I did see. Once I had thoughts, but now I'm white and empty. What am I?",
    "636":"I am a Skull.",
    "637":"When I am filled I can point the way, When I am empty nothing moves me, I have two skins, one without and one within. What am I?",
    "638":"I am a glove.",
    "639":"We are five little objects of an everyday sort. You will find us all in a tennis court. What are we?",
    "640":"Vowels.",
    "641":"I'm the part of the bird that's not in the sky. I can swim in the ocean and yet remain dry. What am I?",
    "642":"A shadow.",
    "643":"A tree doubled in height each year until it reached its maximum height over the course of ten years. How many years did it take for the tree to reach half its maximum height?",
    "644":"Nine Years.",
    "645":"I went into the woods and got it. I sat down to seek it. I brought it home with me because I couldn't find it. What is it?",
    "646":"A splinter.",
    "647":"I go around in circles, But always straight ahead Never complain, No matter where I am led. What am I?",
    "648":"A wheel.",
    "649":"This thing runs but cannot walk, sometimes sings but never talks. Lacks arms, has hands; lacks a head but has a face. What is it?",
    "650":"A Clock.",
    "651":"There is a clerk at the butcher shop, he is five feet ten inches tall, and he wears size 13 sneakers. He has a wife and 2 kids. What does he weigh?",
    "652":"Meat.",
    "653":"I can sizzle like bacon, I am made with an egg, I have plenty of backbone, but lack a good leg, I peel layers like onions, but still remain whole, I can be long, like a flagpole, yet fit in a hole. What am I?",
    "654":"I'm a snake.",
    "655":"What building has the most stories?",
    "656":"The library.",
    "657":"When does a British potato change its nationality?",
    "658":"When it becomes a french fries.",
    "659":"What is faster hot or cold?",
    "660":"Hot, you can easily catch a cold.",
    "661":"What do you call a cow that lost its calf?",
    "662":"De-calf-inated.",
    "663":"I'm made of eight letters, But hold a ninth inside; Pay a very small fee, And send me for a ride. What am I?",
    "664":"An Envelope.",
    "665":"You buy me taken apart, To redo what has be undone; Four of my pieces have one sharp corner, The rest of them have none. What am I?",
    "666":"Jigsaw Puzzle",
    "667":"The more you take away, the more I become. What am I?",
    "668":"A hole.",
    "669":"What's a lifeguard's favorite game?",
    "670":"Pool.",
    "671":"If a rooster laid a brown egg and a white egg, what kind of chicks would hatch?",
    "672":"Roosters don't lay eggs.",
    "673":"When can you add two to eleven and get one as the correct answer?",
    "674":"When you add two hours to eleven o'clock, you get one o'clock.",
    "675":"If you were running a race, and you passed the person in 2nd place, what place would you be in now?",
    "676":"You would be in 2nd. You thought first place, right? Well, you passed the guy in second place, not first.",
    "677":"How can you leave a room with two legs and return with six legs?",
    "678":"Bring a chair back with you.",
    "679":"I have two hands, but I can not scratch myself. What am I?",
    "680":"A clock.",
    "681":"There is an ancient invention still used in some parts of the world today that allows people to see through walls. What is it?",
    "682":"A window.",
    "683":"I'm not clothes but I cover your body; The more I'm used, the thinner I grow. What am I?",
    "684":"Bar of Soap",
    "685":"Mr. and Mrs. Mustard have six daughters and each daughter has one brother. How many people are in the Mustard family?",
    "686":"There are nine Mustards in the family. Since each daughter shares the same brother, there are six girls, one boy and Mr. and Mrs. Mustard.",
    "687":"If fish lived on land, where would they live?",
    "688":"In Finland.",
    "689":"What kind of candy would a prisoner want before he is executed?",
    "690":"A Life Saver.",
    "691":"What do you call a fish with no eye's?",
    "692":"Fsh.",
    "693":"Lily is a lillypad in a small pond. Lilly doubles her size each day, On the 20th day she cover the whole pond. On what day was Lily half the size of the pond?",
    "694":"Day 19, it's not 10 because on day 20 she doubled from day 19, so 19 must be half the size of the pond.",
    "695":"I lead the way into the unknown, and bring strength where there is fear. I am the creator of invention, and the maker of all adventure. What am I?",
    "696":"I Am Curiosity!",
    "697":"How do caterpillars swim laps?",
    "698":"They do the butterfly.",
    "699":"How does the gingerbread man make his bed?",
    "700":"With cookie sheets.",
    "701":"A cloud was my mother, the wind is my father, my son is the cool stream, and my daughter is the fruit of the land. A rainbow is my bed, the earth my final resting place, and I'm the torment of man. Who Am I?",
    "702":"Rain.",
    "703":"What relation would your father's sister's sister-in-law be to you?",
    "704":"This person would be your mother.",
    "705":"What force and strength cannot get through, I with a gentle touch can do. And many in the street would stand, were I not a friend at hand. What am I?",
    "706":"I am a Key.",
    "707":"I have an eye but am blind, a sea, but no water; a bee, but no honey; Tea but no coffee; and a why, but no answer. What am I?",
    "708":"The alphabet.",
    "709":"What liquid is represented by 'hijklmno'?",
    "710":"Water. Hijklmno is 'H to O' in the alphabet. Water is H20.",
    "711":"A magician, had a water glass that was filled to the top. Holding the glass above his head he let it drop to the carpet without spilling a single drop of water. How could he manage to drop the glass from a height of six feet and not spill any water?",
    "712":"The glass was filled, but not with water.",
    "713":"What kind of ears does an engine have?",
    "714":"Engineers.",
    "715":"I have three feet but can't walk; I tell you things but can't talk; Sometimes I bend but I'm mostly straight. I'm like a scale but can't tell your weight. What am I?",
    "716":"A yardstick.",
    "717":"It is hard for me to live, but easy to die. I am only present when I am not given away. Many people know about me but not what I am. You can keep me, but it is hard. What am I?",
    "718":"A secret.",
    "719":"How does Yoda shave?",
    "720":"With a laser-blade.",
    "721":"What's a Jedi's favorite car?",
    "722":"A toy-yoda.",
    "723":"What do you call a robot that takes the longest route?",
    "724":"R2-dtour.",
    "725":"A hole leading in, a hole leading out, we connect to a cavern that is slimey all throughout. What are we?",
    "726":"A Nose.",
    "727":"You go at red, but stop at green. What am I?",
    "728":"Watermelon! You eat the red part, and you stop eating at the green part.",
    "729":"How did the pancake hurt itself?",
    "730":"Doing backflips.",
    "731":"Two girls have the same parents and were born at the same hour of the same day of the same month, but they are not twins. How can this be possible?",
    "732":"They were not born in the same year."
  }
}
